(defun samer-system-packages ()
  (let ((b (current-buffer)))
    (with-temp-buffer
      (insert-file-contents-literally "/var/lib/apt/extended_states")
      (goto-char 0)
      (while (re-search-forward "Package: \\(.*\\)\n.*\nAuto-Installed: 1" nil t)
        (let ((m (match-string 1)))
          (with-current-buffer b
            (insert m "\n")))))))

libxkbcommon-x11-0
linux-headers-generic
linux-image-extra-3.13.0-32-generic
linux-image-3.13.0-32-generic
libxcb-keysyms1
linux-headers-3.13.0-32-generic
linux-headers-3.13.0-32
linux-firmware
linux-image-generic
linux-signed-image-generic
linux-headers-3.13.0-40-generic
linux-signed-image-3.13.0-40-generic
linux-headers-3.13.0-40
linux-image-extra-3.13.0-40-generic
linux-image-3.13.0-40-generic
grub-efi-amd64-bin
grub-efi-amd64
secureboot-db
efibootmgr
shim
liboxideqtquick0
fakeroot
screen-resolution-extra
lib32gcc1
dkms
libcuda1-331
nvidia-settings
nvidia-libopencl1-331
bbswitch-dkms
nvidia-opencl-icd-331
libfakeroot
nvidia-prime
libc6-i386
libvdpau1
libstdc++-4.8-dev
libalgorithm-diff-xs-perl
dpkg-dev
libalgorithm-merge-perl
g++
libalgorithm-diff-perl
g++-4.8
liberror-perl
git-man
aufs-tools
cgroup-lite
lxc-docker-1.3.2
chromium-codecs-ffmpeg-extra
chromium-browser-l10n
liblqr-1-0
libxdot4
libgpg-error-dev
libltdl-dev
libopenexr-dev
liblqr-1-0-dev
libxdamage-dev
libpixman-1-dev
m17n-contrib
postfix
libotf0
libfreetype6-dev
x11proto-render-dev
m4
zlib1g-dev
x11proto-xinerama-dev
libmagickcore-dev
libexif-dev
libpango1.0-dev
libxml-namespacesupport-perl
libgif4
libxmu-dev
libxml-sax-base-perl
libp11-kit-dev
libxcomposite-dev
libxkbcommon-dev
libxcb1-dev
libfftw3-double3
libxcb-shm0-dev
libwayland-dev
libtiffxx5
libilmbase6
libjpeg-turbo8-dev
libpathplan4
libexpat1-dev
libbz2-dev
gir1.2-rsvg-2.0
libxau-dev
libjpeg8-dev
libglib2.0-dev
x11proto-damage-dev
libilmbase-dev
x11proto-core-dev
libxt-dev
libtinfo-dev
m17n-db
libxcb-render0-dev
libjs-jquery
libmagickcore5-extra
libx11-dev
libxml-libxml-perl
x11proto-kb-dev
xtrans-dev
libxdmcp-dev
libxi-dev
libcgraph6
libintl-perl
libxml2-dev
libjasper-dev
libgvc6
x11proto-fixes-dev
libmagickwand5
libwmf-dev
libxpm-dev
libxmu-headers
libpcre3-dev
libpng12-dev
x11proto-randr-dev
libxfixes-dev
po-debconf
libcairo2-dev
libsigsegv2
xorg-sgml-doctools
libxrandr-dev
libxext-dev
libsm-dev
x11proto-xext-dev
gir1.2-gconf-2.0
libdatrie-dev
libxft-dev
libopenexr6
x11proto-input-dev
libharfbuzz-gobject0
libthai-dev
libpcrecpp0
libxrender-dev
libgcrypt11-dev
liblcms2-dev
x11proto-composite-dev
libmagickcore5
libmagick++5
libpthread-stubs0-dev
libgvpr2
xaw3dg
libxinerama-dev
libdjvulibre-dev
xutils-dev
libsepol1-dev
libatk-bridge2.0-dev
libgraphviz-dev
libgdk-pixbuf2.0-dev
libice-dev
imagemagick-common
libjpeg-dev
libm17n-0
autotools-dev
libmagickwand-dev
libgnutlsxx27
libharfbuzz-dev
libtext-unidecode-perl
libfontconfig1-dev
libatk1.0-dev
libxml-sax-perl
libcairo-script-interpreter2
libcdt5
dh-apparmor
libxcursor-dev
liblzma-dev
libtasn1-6-dev
libjbig-dev
libphysfs1
libluajit-5.1-2
libopenal1
liballegro4.4-plugin-alsa
libsdl2-2.0-0
liblcms1
libmng2
libopenal-data
libluajit-5.1-common
libdevil1c2
liballegro4.4
libsdl1.2debian
libmpg123-0
libmodplug1
libxcb-xinerama0
i3-wm
libxdg-basedir1
i3status
libev4
libxcb-cursor0
libjson-xs-perl
libev-perl
suckless-tools
libconfuse0
dunst
libanyevent-i3-perl
libanyevent-perl
libconfuse-common
libxcb-dpms0
libguard-perl
libasync-interrupt-perl
i3lock
libcommon-sense-perl
libv8-3.14.5
nodejs
libc-ares2
node-npmlog
node-node-uuid
gyp
libjs-node-uuid
node-minimatch
node-which
node-async
node-json-stringify-safe
node-nopt
node-cookie-jar
node-tar
node-mute-stream
node-gyp
node-normalize-package-data
node-read-package-json
node-form-data
node-sigmund
node-read
node-graceful-fs
node-mime
node-inherits
node-osenv
node-lru-cache
node-lockfile
node-archy
node-semver
node-fstream
node-glob
node-block-stream
node-qs
node-sha
libssl-dev
nodejs-dev
libv8-3.14-dev
node-request
node-ini
node-retry
node-github-url-from-git
node-delayed-stream
libssl-doc
node-abbrev
node-forever-agent
node-combined-stream
node-fstream-ignore
javascript-common
libc-ares-dev
node-tunnel-agent
node-ansi
node-slide
node-mkdirp
node-once
node-rimraf
libmpeg2-4
libdvdread4
liba52-0.7.4
libmad0
liblastfm1
libqjson0
libchromaprint0
libqxt-gui0
libopencore-amrwb0
libopenjpeg2
libgsm1
libva1
libschroedinger-1.0-0
libxvidcore4
ttf-dejavu-core
libqxt-core0
libftgl2
libtwolame0
libdvdnav4
projectm-data
libmp3lame0
libavcodec54
libx264-142
libprojectm2
libsidplay1
libopus0
libechonest2.1
libavutil52
gstreamer0.10-plugins-ugly
libopencore-amrnb0
libblas3
libwebkitgtk-1.0-0
libgimp2.0
liblapack3
libbabl-0.1-0
gimp-data
libgegl-0.2-0
libamd2.3.1
libumfpack5.6.2
libgfortran3
libwebkitgtk-1.0-common
libcamd2.3.1
libcholmod2.1.2
libjavascriptcoregtk-1.0-0
libccolamd2.8.0
libmono-i18n-west2.0-cil
libmono-microsoft-build-engine4.0-cil
libmono-security2.0-cil
mono-gac
mono-runtime-common
libmono-i18n-west4.0-cil
libmono-microsoft-build2.0-cil
mono-runtime-sgen
libmono-microsoft-build-framework4.0-cil
libmono-xbuild-tasks2.0-cil
libmono-system-core4.0-cil
libmono-security4.0-cil
libmono-corlib2.0-cil
libmono-corlib4.5-cil
libmono-xbuild-tasks4.0-cil
mono-runtime
libmono-i18n4.0-cil
libmono-system-xml4.0-cil
libmono-microsoft-build-utilities-v4.0-4.0-cil
libmono-system2.0-cil
mono-4.0-gac
libmono-system-security4.0-cil
cli-common
libmono-posix2.0-cil
binfmt-support
libmono-system4.0-cil
libmono-system-configuration4.0-cil
libmono-posix4.0-cil
mono-mcs
libmono-csharp4.0c-cil
libmono-microsoft-csharp4.0-cil
libmono-data-tds4.0-cil
libmono-system-data4.0-cil
libmono-system-transactions4.0-cil
libmono-system-enterpriseservices4.0-cil
libgdiplus
libmono-system-web-services4.0-cil
libmono-webbrowser4.0-cil
libmono-system-configuration-install4.0-cil
libmono-system-servicemodel4.0a-cil
libmono-system-identitymodel-selectors4.0-cil
libmono-system-identitymodel4.0-cil
libmono-system-messaging4.0-cil
libmono-system-web4.0-cil
libmono-web4.0-cil
libmono-system-drawing4.0-cil
libmono-accessibility4.0-cil
libmono-system-runtime-serialization-formatters-soap4.0-cil
libmono-system-servicemodel-activation4.0-cil
libmono-system-web-applicationservices4.0-cil
libmono-messaging4.0-cil
libmono-system-windows-forms4.0-cil
libmono-system-data-linq4.0-cil
libmono-system-runtime-serialization4.0-cil
libmono-sqlite4.0-cil
libgl1-mesa-dev
libxshmfence-dev
libglu1-mesa-dev
libxxf86vm-dev
libqt4-qt3support
libxcb-dri3-dev
libdrm-dev
libx11-xcb-dev
x11proto-dri2-dev
libqt4-opengl-dev
libxcb-shape0-dev
libqt4-dev-bin
qt4-linguist-tools
x11proto-xf86vidmode-dev
libxcb-randr0-dev
libxcb-dri2-0-dev
x11proto-gl-dev
libxcb-sync-dev
libxcb-present-dev
libqtwebkit-dev
mesa-common-dev
libxcb-glx0-dev
qt4-qmake
libxcb-xfixes0-dev
cmake-data
libclang1-3.4
libobjc4
libclang-common-3.4-dev
llvm-3.4-runtime
llvm-3.4
llvm-3.4-dev
libobjc-4.8-dev
libffi-dev
libclang1-3.5
libllvm3.5
libclang-common-3.5-dev
llvm-3.5
llvm-3.5-dev
llvm-3.5-runtime
libsdl2-net-2.0-0
x11proto-scrnsaver-dev
libegl1-mesa-dev
libavahi-client-dev
mircommon-dev
libsdl2-ttf-2.0-0
libpulse-dev
libts-0.0-0
libxss-dev
libprotobuf-dev
libmirclient7
libmirprotobuf-dev
libudev-dev
libsdl2-gfx-1.0-0
libmirclientplatform-mesa
libmirprotobuf0
libts-dev
libmirclient-dev
libxv-dev
libgles2-mesa-dev
tsconf
libprotobuf-lite8
libavahi-common-dev
x11proto-video-dev
libkde3support4
ntrack-module-libnl-0
libkasten2controllers2abi1
libkrosscore4
libqapt2
oxygen-icon-theme
libktexteditor4
kdelibs5-data
libhttp-message-perl
libnepomukcleaner4
libkdeui5
libkdeclarative5
liblwp-mediatypes-perl
libhttp-cookies-perl
libhtml-form-perl
kdevelop-data
libthreadweaver4
phonon-backend-gstreamer
liblwp-protocol-https-perl
kde-runtime
libkparts4
libbalooxapian4
nepomuk-core-data
libqca2
libntrack0
kde-runtime-data
libphonon4
libkemoticons4
kdevelop-php-docs-l10n
kdevplatform7-libs
libnepomukquery4a
libzip2
libkmediaplayer4
libhttp-daemon-perl
libprocessui4a
katepart
consolekit
libkdnssd4
soprano-daemon
phonon
libsoprano4
libqapt2-runtime
libvirtodbc0
libkatepartinterfaces4
libsublime7
kdevelop-l10n
libhtml-format-perl
kdelibs5-plugins
phonon-backend-gstreamer-common
libqmobipocket1
libkjsapi4
libkactivities6
libio-html-perl
libokteta1core1
virtuoso-opensource-6.1-common
virtuoso-opensource-6.1-bin
virtuoso-minimal
libnet-http-perl
libkasten2core2
libhtml-parser-perl
libknewstuff3-4
libokteta1gui1
libnepomukutils4
odbcinst1debian2
libwww-robotrules-perl
libprocesscore4abi1
kdoctools
sgml-data
libwww-perl
libqtwebkit-qmlwebkitplugin
libhttp-date-perl
libkxmlrpcclient4
libkpty4
libpam-ck-connector
libkjsembed4
libsolid4
libkhtml5
libntrack-qt4-1
libkfile4
libpoppler-qt4-4
libbaloofiles4
libfile-listing-perl
icoutils
libencode-locale-perl
libattica0.4
libkdesu5
libfont-afm-perl
libnepomukcore4abi1
libdlrestrictions1
libstreams0
libkidletime4
libknotifyconfig4
kdevelop-php-l10n
docbook-xml
libbaloocore4
libkdecore5
kdelibs-bin
libkasten2okteta1core1
libkactivities-bin
nepomuk-core-runtime
plasma-scriptengine-javascript
qapt-batch
libnepomuk4
odbcinst
libstreamanalyzer0
docbook-xsl
libkntlm4
libkdewebkit5
libkcmutils4
libkasten2okteta1controllers1abi1
libpolkit-qt-1-1
libkasten2okteta1gui1
libepub0
libhtml-tagset-perl
libkactivities-models1
libck-connector0
libkubuntu0
libkio5
libxml2-utils
libhtml-tree-perl
kate-data
phonon-backend-gstreamer1.0
libkasten2gui2
kubuntu-debug-installer
shared-desktop-ontologies
libplasma3
libgrantlee-core0
kdevplatform-l10n
libhttp-negotiate-perl
libtinfo5
libxcb-dri2-0
gcc-4.8-base
libxfixes3
libxau6
libpciaccess0
libxext6
libx11-xcb1
libdrm-intel1
libnih-dbus1
libllvm3.4
libgl1-mesa-dri
libdrm-radeon1
libxcb1
libcgmanager0
libgcc1
libc6
libglapi-mesa
libtxc-dxtn-s2tc0
libnih1
libdbus-1-3
libxcb-glx0
libudev1
libgl1-mesa-glx
libxdmcp6
libxcb-sync1
libdrm-nouveau2
zlib1g
libxdamage1
libxxf86vm1
libexpat1
libelf1
libxcb-dri3-0
libxcb-present0
libstdc++6
libdrm2
libx11-6
gcc-4.9-base
libxshmfence1
libffi6
libxrender1
mercurial-common
python-distlib
python-html5lib
python-colorama
python-urllib3
python-setuptools
python-requests
libossp-uuid16
postgresql-common
postgresql-client-9.3
libpq5
postgresql-client-common
vim-runtime
python-sqlite
libsqlite0
libjs-underscore
libjs-sphinxdoc
emacsen-common
emacs23-bin-common
emacs23-common
emacs23
emacs23-common-non-dfsg
ant
libplexus-sec-dispatcher-java
libidl-common
libjna-java
libjsr305-java
libjcommander-java
fop
libjffi-jni
libcommons-logging-java
libplexus-containers-java
libbonobo2-common
libjdom1-java
libguava-java
libjetty-extra-java
libcommons-dbcp-java
libqdox-java
libbcprov-java
libplexus-container-default-java
libeasymock-java
libfop-java
libosgi-core-java
libidl0
libcommons-parent-java
libplexus-io-java
libxml-commons-resolver1.1-java
default-jre
libmaven-scm-java
libsaxon-java
libitext1-java
libasm4-java
libgnuinet-java
libxmlgraphics-commons-java
libcommons-codec-java
libhttpcore-java
libjsch-java
fonts-dejavu-extra
libcommons-jxpath-java
libnative-platform-java
aspectj
libjffi-java
default-jre-headless
libplexus-build-api-java
libjcifs-java
junit4
libyaml-snake-java
libcommons-beanutils-java
libbindex-java
libgeronimo-jta-1.1-spec-java
libasm3-java
libmodello-java
libwagon-java
libjnr-x86asm-java
libnative-platform-jni
libcommons-collections3-java
libhamcrest-java
libgeronimo-jpa-2.0-spec-java
libaether-java
libgeronimo-osgi-support-java
libpolyglot-maven-java
libplexus-classworlds2-java
liblog4j1.2-java
libmx4j-java
libxstream-java
java-wrappers
libcodenarc-groovy-java
libcommons-lang-java
libhttpclient-java
libclassworlds-java
tzdata-java
libjackrabbit-java
libcommons-io-java
rhino
libcommons-pool-java
libcommons-cli-java
libjnr-posix-java
libplexus-ant-factory-java
libnetty-java
ant-optional
libgnome2-common
junit
libcommons-vfs-java
libnetbeans-cvsclient-java
libreflectasm-java
libplexus-utils2-java
libmaven-ant-tasks-java
libaopalliance-java
libjline-java
libjetty-java
libgoogle-gson-java
libcommons-jexl2-java
libservlet3.0-java
libganymed-ssh2-java
libxalan2-java
libcommons-net2-java
openjdk-7-jre-headless
libsisu-guice-java
ca-certificates-java
libatk-wrapper-java
librhino-java
libavalon-framework-java
libapache-pom-java
libgradle-core-java
libgconf2-4
antlr
ivy
libplexus-i18n-java
libosgi-compendium-java
libxerces2-java
libxom-java
libservlet2.5-java
libmaven2-core-java
libregexp-java
libnekohtml-java
libbcpg-java
libjcip-annotations-java
libjansi-java
libplexus-interactivity-api-java
libatinject-jsr330-api-java
libbonobo2-0
libtomcat6-java
libjaxen-java
libplexus-utils-java
libbsh-java
testng
libaspectj-java
liblogback-java
libxml-commons-external-java
libosgi-foundation-ee-java
libgnomevfs2-common
libgnome2-0
libjsoup-java
libxpp3-java
openjdk-7-jre
libplexus-interpolation-java
libasync-http-client-java
groovy
libcglib-java
libdoxia-java
libjaffl-java
libgnomevfs2-0
libjetty-extra
libmaven-parent-java
libplexus-cli-java
libgnome2-bin
libatk-wrapper-java-jni
libdom4j-java
libcdi-api-java
libobjenesis-java
libxpp2-java
bnd
libconstantine-java
liborbit-2-0
checkstyle
libjarjar-java
libmockobjects-java
libjaxp1.3-java
libcommons-httpclient-java
java-common
libplexus-containers1.5-java
libguice-java
libcommons-configuration-java
libxbean-java
libplexus-bsh-factory-java
libbsf-java
libslf4j-java
libbatik-java
bsh
libgnumail-java
libgeronimo-interceptor-3.0-spec-java
libcommons-digester-java
libgmetrics-groovy-java
libkryo-java
libplexus-classworlds-java
libantlr-java
libminlog-java
libjansi-native-java
libgnujaf-java
libwagon2-java
liborbit2
libecj-java
libbcel-java
libplexus-cipher-java
libplexus-archiver-java
libsisu-ioc-java
libgradle-plugins-java
libhawtjni-runtime-java
gsfonts-x11
scala-library
gir1.2-clutter-1.0
gnome-icon-theme-full
gir1.2-gnomedesktop-3.0
gir1.2-json-1.0
gir1.2-coglpango-1.0
gir1.2-gkbd-3.0
gnome-session
libxcb-xv0
libgdm1
libmozjs-24-0
gtk2-engines-pixbuf
libgjs0e
gnome-shell-common
gnome-themes-standard-data
gir1.2-cogl-1.0
libgoa-backend-1.0-1
gnome-control-center
libcaribou0
gir1.2-polkit-1.0
gir1.2-gcr-3
gir1.2-telepathyglib-0.12
gir1.2-xkl-1.0
gir1.2-nmgtk-1.0
gir1.2-gdm-1.0
gir1.2-caribou-1.0
gir1.2-mutter-3.0
gir1.2-upowerglib-1.0
xserver-xephyr
gnome-settings-daemon
gjs
mutter-common
gir1.2-gdesktopenums-3.0
gir1.2-accountsservice-1.0
gir1.2-gck-1
gir1.2-telepathylogger-0.2
libxcb-xf86dri0
libcaribou-common
gnome-themes-standard
libmutter0c
gnome-control-center-data
grilo-plugins-0.2
gir1.2-evince-3.0
argyll
libtracker-miner-0.16-0
libmediaart-1.0-0
spamassassin
gir1.2-zpj-0.0
libicc2
gnome-online-miners
spamc
tracker
libcolord-gtk1
sa-compile
evolution-indicator
xsltproc
libmusicbrainz5-0
gir1.2-gtkclutter-1.0
gir1.2-gtop-2.0
libevolution
tracker-extract
libtracker-sparql-0.16-0
unoconv
libimdi0
gir1.2-clutter-gst-2.0
libytnef0
libpst4
evolution-plugins
gnome-tweak-tool
tracker-utils
re2c
libgtkhtml-4.0-common
libzapojit-0.0-0
libgrilo-0.2-1
gir1.2-tracker-0.16
libgsf-1-common
libsys-hostname-long-perl
libgtkhtml-editor-4.0-0
libenca0
python-boto
python-cloudfiles
libmail-spf-perl
libgupnp-av-1.0-2
libgsf-1-114
gir1.2-rest-0.7
tracker-miner-fs
evolution-common
libgtkhtml-4.0-0
libnetaddr-ip-perl
libtracker-extract-0.16-0
libiptcdata0
fonts-takao-gothic
fonts-takao-mincho
libtokyocabinet9
gconf-defaults-service
libept1.4.12
libcwidget3
libboost-iostreams1.54.0
aptitude-common
